app/Controllers/Login.php

    public function index()
    {
        $userModel = new UserModel();

        $nip = $this->request->getVar('nip');
        $password = $this->request->getVar('password');

        $user = $userModel->where('nip', $nip)->first();
---
SELECT *
FROM "users"
WHERE "nip" = '198702112010121004'
 LIMIT 1