app/Controllers/Register.php

INSERT INTO "users" ("email", "password", "created_at", "updated_at") VALUES ('sgt.wibowo@gmail.com', '$2y$10$w/TRvN3SMoRTntJrqxc6PeWLWHUK1P29bWqf3XajU.R6D41oQ4yqK', '2024-12-05 18:37:44', '2024-12-05 18:37:44')
---
    public function index()
    {
        $rules = [
            'nip' => ['rules' => 'required|min_length[18]|max_length[28]|is_unique[users.nip]'],
            'password' => ['rules' => 'required|min_length[8]|max_length[255]'],
            'confirm_password'  => [ 'label' => 'confirm password', 'rules' => 'matches[password]']
        ];


        if($this->validate($rules)){
            $model = new UserModel();
            $data = [
                'nip'    => $this->request->getVar('nip'),
                'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
            ];
            $model->save($data);